hoangmirs/mirs-car-robot/src/esp32cam/app_httpd.cpp
  if (parse_get(req, &buf) != ESP_OK)
  {
    return ESP_FAIL;
  }

  int startX = parse_get_var(buf, "sx", 0);
  int startY = parse_get_var(buf, "sy", 0);
  int endX = parse_get_var(buf, "ex", 0);
  int endY = parse_get_var(buf, "ey", 0);
  int offsetX = parse_get_var(buf, "offx", 0);
  int offsetY = parse_get_var(buf, "offy", 0);
  int totalX = parse_get_var(buf, "tx", 0);
  int totalY = parse_get_var(buf, "ty", 0); // codespell:ignore totaly
  int outputX = parse_get_var(buf, "ox", 0);
  int outputY = parse_get_var(buf, "oy", 0);
  bool scale = parse_get_var(buf, "scale", 0) == 1;
  bool binning = parse_get_var(buf, "binning", 0) == 1;
  free(buf);

  log_i(
      "Set Window: Start: %d %d, End: %d %d, Offset: %d %d, Total: %d %d, Output: %d %d, Scale: %u, Binning: %u", startX, startY, endX, endY, offsetX, offsetY,
      totalX, totalY, outputX, outputY, scale, binning // codespell:ignore totaly
  );
  sensor_t *s = esp_camera_sensor_get();
  int res = s->set_res_raw(s, startX, startY, endX, endY, offsetX, offsetY, totalX, totalY, outputX, outputY, scale, binning); // codespell:ignore totaly
  if (res)
  {
    return httpd_resp_send_500(req);
  }

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, NULL, 0);
}

static esp_err_t index_handler(httpd_req_t *req)
{
  // httpd_resp_set_type(req, "text/html");
  // httpd_resp_set_hdr(req, "Content-Encoding", "gzip");
  // sensor_t *s = esp_camera_sensor_get();
  // if (s != NULL) {
  //   if (s->id.PID == OV3660_PID) {
  //     return httpd_resp_send(req, (const char *)index_ov3660_html_gz, index_ov3660_html_gz_len);
  //   } else if (s->id.PID == OV5640_PID) {
  //     return httpd_resp_send(req, (const char *)index_ov5640_html_gz, index_ov5640_html_gz_len);
  //   } else {
  //     return httpd_resp_send(req, (const char *)index_ov2640_html_gz, index_ov2640_html_gz_len);
  //   }
  // } else {
  //   log_e("Camera sensor not found");
  //   return httpd_resp_send_500(req);
  // }
  httpd_resp_set_type(req, "text/html");
  String page = "";
  page += "<meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0\">\n";
  page += "<style>p { user-select: none; -webkit-user-select: none; -moz-user-select: none; -ms-user-select: none; }</style>\n";
  page += "<script>var xhttp = new XMLHttpRequest();</script>";
  page += "<script>function getsend(arg) { xhttp.open('GET', arg +'?' + new Date().getTime(), true); xhttp.send() } </script>";
  page += "<p align=center><IMG SRC='http://" + WiFiAddr + ":81/stream' style='width:360px;transform:rotate(0deg);'></p><br/><br/>";

  // page += "<p align=center>";
  // page += "<button style=background-color:lightgrey;width:90px;height:40px onmousedown=getsend('leftup') onmouseup=getsend('stop') ontouchstart=getsend('leftup') ontouchend=getsend('stop')><b>LeftUp</b></button>&nbsp;";
  // page += "<button style=background-color:lightgrey;width:90px;height:40px onmousedown=getsend('go') onmouseup=getsend('stop') ontouchstart=getsend('go') ontouchend=getsend('stop') ><b>Forward</b></button>&nbsp;";
  // page += "<button style=background-color:lightgrey;width:90px;height:40px onmousedown=getsend('rightup') onmouseup=getsend('stop') ontouchstart=getsend('rightup') ontouchend=getsend('stop') ><b>RightUp</b></button>";
  // page += "</p>";

  // page += "<p align=center>";
  // page += "<button style=background-color:lightgrey;width:90px;height:40px; onmousedown=getsend('left') onmouseup=getsend('stop') ontouchstart=getsend('left') ontouchend=getsend('stop')><b>Left</b></button>&nbsp;";
  // page += "<button style=background-color:lightgrey;width:90px;height:40px; onmousedown=getsend('clockwise') onmouseup=getsend('stop') ontouchstart=getsend('clockwise') ontouchend=getsend('stop')><b>Clockwise</b></button>&nbsp;";
  // page += "<button style=background-color:lightgrey;width:90px;height:40px onmousedown=getsend('right') onmouseup=getsend('stop') ontouchstart=getsend('right') ontouchend=getsend('stop')><b>Right</b></button>";
  // page += "</p>";

  // page += "<p align=center>";
  // page += "<button style=background-color:lightgrey;width:90px;height:40px onmousedown=getsend('leftdown') onmouseup=getsend('stop') ontouchstart=getsend('leftdown') ontouchend=getsend('stop') ><b>LeftDown</b></button>&nbsp;";
  // page += "<button style=background-color:lightgrey;width:90px;height:40px onmousedown=getsend('back') onmouseup=getsend('stop') ontouchstart=getsend('back') ontouchend=getsend('stop') ><b>Backward</b></button>&nbsp;";
  // page += "<button style=background-color:lightgrey;width:90px;height:40px onmousedown=getsend('rightdown') onmouseup=getsend('stop') ontouchstart=getsend('rightdown') ontouchend=getsend('stop') ><b>RightDown</b></button>";
  // page += "</p>";
  page += "<p align=center>";
  page += "<button style=background-color:lightgrey;width:90px;height:40px; onmousedown=getsend('leftup') onmouseup=getsend('stop') ontouchstart=getsend('leftup') ontouchend=getsend('stop')><b>LeftUp</b></button>&nbsp;";
  page += "<button style=background-color:lightgrey;width:90px;height:40px; onmousedown=getsend('go') onmouseup=getsend('stop') ontouchstart=getsend('go') ontouchend=getsend('stop') ><b>Forward</b></button>&nbsp;";
  page += "<button style=background-color:lightgrey;width:90px;height:40px onmousedown=getsend('rightup') onmouseup=getsend('stop') ontouchstart=getsend('rightup') ontouchend=getsend('stop') ><b>RightUp</b></button>";
  page += "</p>";

  page += "<p align=center>";
  page += "<button style=background-color:lightgrey;width:90px;height:40px; onmousedown=getsend('left') onmouseup=getsend('stop') ontouchstart=getsend('left') ontouchend=getsend('stop')><b>Left</b></button>&nbsp;";
  page += "<button style=background-color:indianred;width:100px;height:40px; onmousedown=getsend('stop') onmouseup=getsend('stop')><b>Stop</b></button>&nbsp;";
  page += "<button style=background-color:lightgrey;width:90px;height:40px; onmousedown=getsend('right') onmouseup=getsend('stop') ontouchstart=getsend('right') ontouchend=getsend('stop')><b>Right</b></button>";
  page += "</p>";

  page += "<p align=center>";
  page += "<button style=background-color:lightgrey;width:90px;height:40px; onmousedown=getsend('leftdown') onmouseup=getsend('stop') ontouchstart=getsend('leftdown') ontouchend=getsend('stop') ><b>LeftDown</b></button>&nbsp;";
  page += "<button style=background-color:lightgrey;width:90px;height:40px; onmousedown=getsend('back') onmouseup=getsend('stop') ontouchstart=getsend('back') ontouchend=getsend('stop') ><b>Backward</b></button>&nbsp;";
  page += "<button style=background-color:lightgrey;width:90px;height:40px; onmousedown=getsend('rightdown') onmouseup=getsend('stop') ontouchstart=getsend('rightdown') ontouchend=getsend('stop') ><b>RightDown</b></button>";
  page += "</p>";

  page += "<p align=center>";
  page += "<button style=background-color:lightgrey;width:120px;height:40px; onmousedown=getsend('clockwise') onmouseup=getsend('stop') ontouchstart=getsend('clockwise') ontouchend=getsend('stop') ><b>Clockwise</b></button>&nbsp;";
  page += "<button style=background-color:lightgrey;width:120px;height:40px; onmousedown=getsend('contrario') onmouseup=getsend('stop') ontouchstart=getsend('contrario') ontouchend=getsend('stop') ><b>Contrario</b></button>&nbsp;";
  page += "</p>";

  page += "<p align=center>";
  page += "<button style=background-color:lightgrey;width:120px;height:40px; onmousedown=getsend('model1') onmouseup=getsend('model1') ontouchstart=getsend('model1') ontouchend=getsend('model1') ><b>model1</b></button>&nbsp;";
  page += "<button style=background-color:lightgrey;width:120px;height:40px; onmousedown=getsend('model2') onmouseup=getsend('model2') ontouchstart=getsend('model2') ontouchend=getsend('model2') ><b>model2</b></button>";
  page += "</p>";

  page += "<p align=center>";
  page += "<button style=background-color:lightgrey;width:120px;height:40px; onmousedown=getsend('model3') onmouseup=getsend('model3') ontouchstart=getsend('model3') ontouchend=getsend('model3') ><b>model3</b></button>&nbsp;";
  page += "<button style=background-color:lightgrey;width:120px;height:40px; onmousedown=getsend('model4') onmouseup=getsend('model4') ontouchstart=getsend('model4') ontouchend=getsend('model4') ><b>model4</b></button>";
  page += "</p>";

  page += "<p align=center>";
  page += "<button style=background-color:lightgrey;width:120px;height:40px; onmousedown=getsend('motorleft') onmouseup=getsend('stop') ontouchstart=getsend('motorleft') ontouchend=getsend('stop') ><b>MotorLeft</b></button>&nbsp;";
  page += "<button style=background-color:lightgrey;width:120px;height:40px; onmousedown=getsend('motorright') onmouseup=getsend('stop') ontouchstart=getsend('motorright') ontouchend=getsend('stop') ><b>MotorRight</b></button>";
  page += "</p>";

  page += "<p align=center>";
  page += "<button style=background-color:yellow;width:100px;height:40px; onmousedown=getsend('ledon')><b>Light ON</b></button>&nbsp;";
  page += "<button style=background-color:indianred;width:100px;height:40px; onmousedown=getsend('stop') onmouseup=getsend('stop')><b>Stop</b></button>&nbsp;";
  page += "<button style=background-color:yellow;width:100px;height:40px; onmousedown=getsend('ledoff')><b>Light OFF</b></button>";
  page += "</p>";

