hoangmirs/mirs-car-robot/src/esp32cam/app_httpd.cpp
  return httpd_resp_send(req, &page[0], strlen(&page[0]));
}

/* URI 处理函数*/
static esp_err_t go_handler(httpd_req_t *req)
{
  txdata[1] = Forward;
  Serial.write(txdata, 3);
  Serial.println("Go");
  httpd_resp_set_type(req, "text/html");
  return httpd_resp_send(req, "OK", 2);
}
static esp_err_t back_handler(httpd_req_t *req)
{
  txdata[1] = Backward;
  Serial.write(txdata, 3);
  Serial.println("Back");
  httpd_resp_set_type(req, "text/html");
  return httpd_resp_send(req, "OK", 2);
}
static esp_err_t left_handler(httpd_req_t *req)
{
  txdata[1] = Turn_Left;
  Serial.write(txdata, 3);
  Serial.println("Left");
  httpd_resp_set_type(req, "text/html");
  return httpd_resp_send(req, "OK", 2);
}
static esp_err_t right_handler(httpd_req_t *req)
{
  txdata[1] = Turn_Right;
  Serial.write(txdata, 3);
  Serial.println("Right");
  httpd_resp_set_type(req, "text/html");
  return httpd_resp_send(req, "OK", 2);
}
static esp_err_t stop_handler(httpd_req_t *req)
{
  txdata[1] = Stop;
  Serial.write(txdata, 3);
  Serial.println("Stop");
  httpd_resp_set_type(req, "text/html");
  return httpd_resp_send(req, "OK", 2);
}
static esp_err_t ledon_handler(httpd_req_t *req)
{
  digitalWrite(gpLed, HIGH);
  Serial.println("LED ON");
  httpd_resp_set_type(req, "text/html");
  return httpd_resp_send(req, "OK", 2);
}
static esp_err_t ledoff_handler(httpd_req_t *req)
{
  digitalWrite(gpLed, LOW);
  Serial.println("LED OFF");
  httpd_resp_set_type(req, "text/html");
  return httpd_resp_send(req, "OK", 2);
}

//////////////////////////////new/////////////////////////////////
static esp_err_t leftup_handler(httpd_req_t *req) // 左上
{
  txdata[1] = Top_Left;
  Serial.write(txdata, 3);
  Serial.println("leftup");
  httpd_resp_set_type(req, "text/html");
  return httpd_resp_send(req, "OK", 2);
}
static esp_err_t leftdown_handler(httpd_req_t *req) // 左下
{
  txdata[1] = Bottom_Left;
  Serial.write(txdata, 3);
  Serial.println("leftdown");
  httpd_resp_set_type(req, "text/html");
  return httpd_resp_send(req, "OK", 2);
}
static esp_err_t rightup_handler(httpd_req_t *req) // 右上
{
  txdata[1] = Top_Right;
  Serial.write(txdata, 3);
  Serial.println("rightup");
  httpd_resp_set_type(req, "text/html");
  return httpd_resp_send(req, "OK", 2);
}
static esp_err_t rightdown_handler(httpd_req_t *req) // 右下
{
  txdata[1] = Bottom_Right;
  Serial.write(txdata, 3);
  Serial.println("rightdown");
  httpd_resp_set_type(req, "text/html");
  return httpd_resp_send(req, "OK", 2);
}
static esp_err_t clockwise_handler(httpd_req_t *req) // 顺时针原地旋转
{
  txdata[1] = Clockwise;
  Serial.write(txdata, 3);
  Serial.println("clockwise");
  httpd_resp_set_type(req, "text/html");
  return httpd_resp_send(req, "OK", 2);
}
static esp_err_t contrario_handler(httpd_req_t *req) // 逆时针原地旋转
{
  txdata[1] = Contrarotate;
  Serial.write(txdata, 3);
  Serial.println("contrario");
  httpd_resp_set_type(req, "text/html");
  return httpd_resp_send(req, "OK", 2);
}
static esp_err_t model1_handler(httpd_req_t *req) // 模式1 自由模式
{
  txdata[1] = Moedl1;
  Serial.write(txdata, 3);
  Serial.println("model1");
  httpd_resp_set_type(req, "text/html");
  return httpd_resp_send(req, "OK", 2);
}
static esp_err_t model2_handler(httpd_req_t *req) // 模式2 避障模式
{
  txdata[1] = Moedl2;
  Serial.write(txdata, 3);
  Serial.println("model2");
  httpd_resp_set_type(req, "text/html");
  return httpd_resp_send(req, "OK", 2);
}
static esp_err_t model3_handler(httpd_req_t *req) // 模式3 跟随模式
{
  txdata[1] = Moedl3;
  Serial.write(txdata, 3);
  Serial.println("model3");
  httpd_resp_set_type(req, "text/html");
  return httpd_resp_send(req, "OK", 2);
}
static esp_err_t model4_handler(httpd_req_t *req) // 模式4 巡线模式
{
  txdata[1] = Moedl4;
  Serial.write(txdata, 3);
  Serial.println("model4");
  httpd_resp_set_type(req, "text/html");
  return httpd_resp_send(req, "OK", 2);
}
static esp_err_t motorleft_handler(httpd_req_t *req) // 舵机左转
{
  txdata[1] = MotorLeft;
  Serial.write(txdata, 3);
  Serial.println("MotorLeft");
  httpd_resp_set_type(req, "text/html");
  return httpd_resp_send(req, "OK", 2);
}
static esp_err_t motorright_handler(httpd_req_t *req) // 舵机右转
{
  txdata[1] = MotorRight;
  Serial.write(txdata, 3);
  Serial.println("MotorRight");
  httpd_resp_set_type(req, "text/html");
  return httpd_resp_send(req, "OK", 2);
}
//////////////////////////////new/////////////////////////////////

void startCameraServer()
{
  httpd_config_t config = HTTPD_DEFAULT_CONFIG();
  config.max_uri_handlers = 30;
  config.max_resp_headers = 30;

  httpd_uri_t index_uri = {
      .uri = "/",
      .method = HTTP_GET,
      .handler = index_handler,
      .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
      ,
      .is_websocket = true,
      .handle_ws_control_frames = false,
      .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t status_uri = {
      .uri = "/status",
      .method = HTTP_GET,
      .handler = status_handler,
      .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
      ,
      .is_websocket = true,
      .handle_ws_control_frames = false,
      .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t cmd_uri = {
      .uri = "/control",
      .method = HTTP_GET,
      .handler = cmd_handler,
      .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
      ,
      .is_websocket = true,
      .handle_ws_control_frames = false,
      .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t capture_uri = {
      .uri = "/capture",
      .method = HTTP_GET,
      .handler = capture_handler,
      .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
      ,
      .is_websocket = true,
      .handle_ws_control_frames = false,
      .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t stream_uri = {
      .uri = "/stream",
      .method = HTTP_GET,
      .handler = stream_handler,
      .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
      ,
      .is_websocket = true,
      .handle_ws_control_frames = false,
      .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t bmp_uri = {
      .uri = "/bmp",
      .method = HTTP_GET,
      .handler = bmp_handler,
      .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
      ,
      .is_websocket = true,
      .handle_ws_control_frames = false,
      .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t xclk_uri = {
      .uri = "/xclk",
      .method = HTTP_GET,
      .handler = xclk_handler,
      .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
      ,
      .is_websocket = true,
      .handle_ws_control_frames = false,
      .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t reg_uri = {
      .uri = "/reg",
      .method = HTTP_GET,
      .handler = reg_handler,
      .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
      ,
      .is_websocket = true,
      .handle_ws_control_frames = false,
      .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t greg_uri = {
      .uri = "/greg",
      .method = HTTP_GET,
      .handler = greg_handler,
      .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
      ,
      .is_websocket = true,
      .handle_ws_control_frames = false,
      .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t pll_uri = {
      .uri = "/pll",
      .method = HTTP_GET,
      .handler = pll_handler,
      .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
      ,
      .is_websocket = true,
      .handle_ws_control_frames = false,
      .supported_subprotocol = NULL
#endif
  };

