hoangmirs/mirs-car-robot/src/esp32cam/app_httpd.cpp
  httpd_uri_t win_uri = {
      .uri = "/resolution",
      .method = HTTP_GET,
      .handler = win_handler,
      .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
      ,
      .is_websocket = true,
      .handle_ws_control_frames = false,
      .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t go_uri = {
      .uri = "/go",
      .method = HTTP_GET,
      .handler = go_handler,
      .user_ctx = NULL};

  httpd_uri_t back_uri = {
      .uri = "/back",
      .method = HTTP_GET,
      .handler = back_handler,
      .user_ctx = NULL};

  httpd_uri_t stop_uri = {
      .uri = "/stop",
      .method = HTTP_GET,
      .handler = stop_handler,
      .user_ctx = NULL};

  httpd_uri_t left_uri = {
      .uri = "/left",
      .method = HTTP_GET,
      .handler = left_handler,
      .user_ctx = NULL};

  httpd_uri_t right_uri = {
      .uri = "/right",
      .method = HTTP_GET,
      .handler = right_handler,
      .user_ctx = NULL};

  //////////////////////////////new/////////////////////////////////
  httpd_uri_t leftup_uri = {// 左上
                            .uri = "/leftup",
                            .method = HTTP_GET,
                            .handler = leftup_handler,
                            .user_ctx = NULL};

  httpd_uri_t leftdown_uri = {// 左下
                              .uri = "/leftdown",
                              .method = HTTP_GET,
                              .handler = leftdown_handler,
                              .user_ctx = NULL};

  httpd_uri_t rightup_uri = {// 右上
                             .uri = "/rightup",
                             .method = HTTP_GET,
                             .handler = rightup_handler,
                             .user_ctx = NULL};

  httpd_uri_t rightdown_uri = {// 右下
                               .uri = "/rightdown",
                               .method = HTTP_GET,
                               .handler = rightdown_handler,
                               .user_ctx = NULL};

  httpd_uri_t clockwise_uri = {// 顺时针原地旋转
                               .uri = "/clockwise",
                               .method = HTTP_GET,
                               .handler = clockwise_handler,
                               .user_ctx = NULL};

  httpd_uri_t contrario_uri = {// 逆时针原地旋转
                               .uri = "/contrario",
                               .method = HTTP_GET,
                               .handler = contrario_handler,
                               .user_ctx = NULL};

  httpd_uri_t model1_uri = {// 模式1
                            .uri = "/model1",
                            .method = HTTP_GET,
                            .handler = model1_handler,
                            .user_ctx = NULL};

  httpd_uri_t model2_uri = {// 模式2
                            .uri = "/model2",
                            .method = HTTP_GET,
                            .handler = model2_handler,
                            .user_ctx = NULL};

  httpd_uri_t model3_uri = {// 模式3
                            .uri = "/model3",
                            .method = HTTP_GET,
                            .handler = model3_handler,
                            .user_ctx = NULL};
  httpd_uri_t model4_uri = {// 模式4
                            .uri = "/model4",
                            .method = HTTP_GET,
                            .handler = model4_handler,
                            .user_ctx = NULL};
  httpd_uri_t motorleft_uri = {// 舵机左转
                               .uri = "/motorleft",
                               .method = HTTP_GET,
                               .handler = motorleft_handler,
                               .user_ctx = NULL};
  httpd_uri_t motorright_uri = {// 舵机右转
                                .uri = "/motorright",
                                .method = HTTP_GET,
                                .handler = motorright_handler,
                                .user_ctx = NULL};
  //////////////////////////////new/////////////////////////////////

  httpd_uri_t ledon_uri = {
      .uri = "/ledon",
      .method = HTTP_GET,
      .handler = ledon_handler,
      .user_ctx = NULL};

  httpd_uri_t ledoff_uri = {
      .uri = "/ledoff",
      .method = HTTP_GET,
      .handler = ledoff_handler,
      .user_ctx = NULL};

  ra_filter_init(&ra_filter, 20);

  log_i("Starting web server on port: '%d'", config.server_port);
  if (httpd_start(&camera_httpd, &config) == ESP_OK)
  {
    httpd_register_uri_handler(camera_httpd, &index_uri);
    httpd_register_uri_handler(camera_httpd, &cmd_uri);
    httpd_register_uri_handler(camera_httpd, &status_uri);
    httpd_register_uri_handler(camera_httpd, &capture_uri);
    httpd_register_uri_handler(camera_httpd, &bmp_uri);

    httpd_register_uri_handler(camera_httpd, &xclk_uri);
    httpd_register_uri_handler(camera_httpd, &reg_uri);
    httpd_register_uri_handler(camera_httpd, &greg_uri);
    httpd_register_uri_handler(camera_httpd, &pll_uri);
    httpd_register_uri_handler(camera_httpd, &win_uri);

    //////////////////////////////new/////////////////////////////////
    httpd_register_uri_handler(camera_httpd, &go_uri);
    httpd_register_uri_handler(camera_httpd, &back_uri);
    httpd_register_uri_handler(camera_httpd, &stop_uri);
    httpd_register_uri_handler(camera_httpd, &left_uri);
    httpd_register_uri_handler(camera_httpd, &right_uri);
    httpd_register_uri_handler(camera_httpd, &ledon_uri);
    httpd_register_uri_handler(camera_httpd, &ledoff_uri);
    httpd_register_uri_handler(camera_httpd, &leftup_uri);
    httpd_register_uri_handler(camera_httpd, &leftdown_uri);
    httpd_register_uri_handler(camera_httpd, &rightup_uri);
    httpd_register_uri_handler(camera_httpd, &rightdown_uri);
    httpd_register_uri_handler(camera_httpd, &clockwise_uri);
    httpd_register_uri_handler(camera_httpd, &contrario_uri);
    httpd_register_uri_handler(camera_httpd, &model1_uri);
    httpd_register_uri_handler(camera_httpd, &model2_uri);
    httpd_register_uri_handler(camera_httpd, &model3_uri);
    httpd_register_uri_handler(camera_httpd, &model4_uri);
    httpd_register_uri_handler(camera_httpd, &motorleft_uri);
    httpd_register_uri_handler(camera_httpd, &motorright_uri);
    //////////////////////////////new/////////////////////////////////
  }

  config.server_port += 1;
  config.ctrl_port += 1;
  log_i("Starting stream server on port: '%d'", config.server_port);
  if (httpd_start(&stream_httpd, &config) == ESP_OK)
  {
    httpd_register_uri_handler(stream_httpd, &stream_uri);
  }
}

// void setupLedFlash(int pin)
// {
// #if CONFIG_LED_ILLUMINATOR_ENABLED
//   ledcAttachPin(pin, LEDC_CHANNEL_0);
//   ledcSetup(LEDC_CHANNEL_0, 5000, 8);
// #else
//   log_i("LED flash is disabled -> CONFIG_LED_ILLUMINATOR_ENABLED = 0");
// #endif
// }
